insert into Жанр(Название_жанра)
values
	('рэп и хип-хоп'),
	('рок'),
	('фолк'),
	('поп')
;

insert into Исполнитель(Имя_Псевдоним)
values
	('Scorpions'),
	('Eminem'),
	('Игорь Тальков'),
	('Eivør'),
	('X-Perience'),
	('Баста'),
	('Rammtein')
;

insert into Альбом(Название_альбома, Год_выпуска_альбома)
values
    ('Face The Heat', 1993),
    ('The Eminem Show', 2002),
    ('The Slim Shady LP', 1999),
    ('Россия', 1991),
    ('Slør', 2015),
    ('555', 2020),
	('БАСТА 1', 2006),
	('Баста 5. Часть 2', 2016),
	('Улица', 2017),
    ('Mutter', 2001),
	('Rammstein', 2019)
;

insert into Трэк(Название_трэка, Длительность_трэка, Альбом_ID)
values
    ('No Pain No Gain', 3*60+54, 1),
    ('Sing For The Moment', 5*60+40, 2),
    ('My Name Is', 4*60+28, 3),
    ('Я вернусь', 6*60+22, 4),
    ('Í Tokuni', 3*60+31, 5),
    ('Verd Mín', 4*60+56, 5),
    ('I Feel Like You 555', 3*60+32, 6),
    ('Моя игра', 4*60+30, 7),
    ('Выпускной (Медлячок)', 5*60+35, 8),
   	('Улица', 5*60+05, 9),
   	('Sonne', 4*60+32, 10),
   	('Mein Herz Brennt', 4*60+39, 10),
   	('DEUTSCHLAND', 5*60+22, 11)
;

insert into Сборник(Название_сборника, Год_выпуска_сборника)
values
    ('90-е', 2021),
    ('00-е', 2022),
    ('10-е', 2023), 
    ('20-е', 2024)
;

insert into Жанр_Исполнитель(Жанр_ID, Исполнитель_ID)
values
    (1, 2),
    (1, 6),
    (2, 1),
    (2, 3),
    (2, 7),
   	(3, 4),
   	(4, 5)
;

insert into Исполнитель_Альбом(Исполнитель_ID, Альбом_ID)
values
    (1, 1),
    (2, 2),
    (2, 3),
    (3, 4),
    (4, 5),
    (5, 6),
    (6, 7),
    (6, 8),
    (6, 9),
    (7, 10),
    (7, 11)
;

insert into Трэк_Сборник(Трэк_ID, Сборник_ID)
values
    (1, 1),
    (2, 2),
    (3, 1),
    (4, 1),
    (5, 3),
    (6, 3),
    (7, 4),
    (8, 2),
    (9, 2),
    (10, 2),
    (11, 3),
    (12, 2),
    (13, 3)
;
